

data = {
  "eventid": "מזהה ייחודי לאירוע",  #חשוב!
  "iyear": "השנה שבה התרחש האירוע",  #חשוב!
  "imonth": "החודש שבו התרחש האירוע",  #חשוב!
  "iday": "היום שבו התרחש האירוע", #חשוב!
  "location": {
    "country": "מזהה המדינה שבה התרחש האירוע", #חשוב!
    "country_txt": "שם המדינה", #חשוב!
    "region": "מזהה האזור הגאוגרפי של המדינה", #חשוב!
    "region_txt": "שם האזור הגאוגרפי", #חשוב!
    "city": "שם העיר שבה התרחש האירוע", #חשוב!
    "latitude": "קו רוחב של מיקום האירוע", #חשוב!
    "longitude": "קו אורך של מיקום האירוע", #חשוב!
  },
  "attack_details": {
    "attacktype1": "מזהה סוג ההתקפה הראשי",  #חשוב!
    "attacktype1_txt": "תיאור סוג ההתקפה הראשי",  #חשוב!
    "attacktype2": "מזהה סוג התקפה משני",  #חשוב!
    "attacktype2_txt": "תיאור סוג ההתקפה המשני",  #חשוב!
    "attacktype3": "מזהה סוג התקפה שלישי", #חשוב!
    "attacktype3_txt": "תיאור סוג ההתקפה השלישי" #חשוב!
  },
  "target_details": {
    "primary_target": {
      "targtype1": "מזהה סוג המטרה הראשית",  #חשוב!
      "targtype1_txt": "תיאור סוג המטרה",  #חשוב!
      "targsubtype1": "תת-קטגוריה של המטרה",
      "targsubtype1_txt": "תיאור תת-הקטגוריה",
      "corp1": "שם הארגון או החברה שנפגעו",  #חשוב!
      "target1": "תיאור המטרה",  #חשוב!
      "natlty1": "מזהה לאום של המטרה",  #חשוב!
      "natlty1_txt": "שם הלאום" #חשוב!
    },
    "secondary_and_tertiary_targets":
      {
        "targtype": "מזהה סוג המטרה המשנית", #חשוב!
        "targtype_txt": "תיאור סוג המטרה המשנית", #חשוב!
        "targsubtype": "תת-קטגוריה של המטרה המשנית", #חשוב!
        "targsubtype_txt": "תיאור תת-הקטגוריה של המטרה המשנית", #חשוב!
        "corp": "שם הארגון או החברה שנפגעו", #חשוב!
        "target": "תיאור המטרה", #חשוב!
        "natlty": "מזהה לאום של המטרה", #חשוב!
        "natlty_txt": "שם הלאום" #חשוב!
      }
  },
  "perpetrators": {
    "gname": "שם הארגון האחראי לפעולה", #חשוב!
    "gsubname": "תת-קבוצה בארגון", #חשוב!
    "gname2": "ארגון שני אחראי", #חשוב!
    "gsubname2": "תת-קבוצה בארגון השני", #חשוב!
    "gname3": "ארגון שלישי אחראי", #חשוב!
    "gsubname3": "תת-קבוצה בארגון השלישי",
    "nperps": "מספר המעורבים", #חשוב!
  },
  "casualties": {
    "nkill": "מספר ההרוגים", #חשוב!
    "nkillter": "מספר ההרוגים בקרב התוקפים", #זבל
    "nwound": "מספר הפצועים", #חשוב!
    "nwoundte": "מספר הפצועים בקרב התוקפים",# #זבל
"number_of_casualties_calc" : "int" #חדש!!
  },
}

calc_data={
    "number_of_casualties_calc" : "int",
}


semple_object = {
  "event_id": "מזהה ייחודי לאירוע",  #חשוב!
  "num_kill": "מספר ההרוגים",  # חשוב!
  "num_wound": "מספר הפצועים",  # חשוב!
  "number_of_casualties_calc" : "int",
  "date": "15/7/2020",
  "location": {
    "country_name": "שם המדינה", #חשוב!
    "region_txt": "שם האזור הגאוגרפי", #חשוב!
    "city": "שם העיר שבה התרחש האירוע", #חשוב!
    "latitude": "קו רוחב של מיקום האירוע", #חשוב!
    "longitude": "קו אורך של מיקום האירוע", #חשוב!
  },
  "attack_type": ["attacktype1_txt"],
  "target_types": [{
    "target_type":"targtype1_txt",
    "target": "תיאור המטרה",
  },{
    "target_type":"targtype1_txt",
    "target": "תיאור המטרה",
  }],
  "group_name": ["שם הארגון האחראי לפעולה"]
}